Revit 2026 API

# CustomExporter Constructor

---

Constructs a new instance of a CustomExporter for a given document using the input instance of IExportContext as the output device.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CustomExporter(
	Document document,
	IExportContext context
)
```
```vb
Public Sub New (
	document As Document,
	context As IExportContext
)
```
```cpp
public:
CustomExporter(
	Document^ document,
	IExportContext^ context
)
```
```fsharp
new :
        document : Document *
        context : IExportContext -> CustomExporter
```

#### Parameters

document Document
     The document containing the model to be exported
context IExportContext
     An instance of a context class that will be consuming the output

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The input context should be an instance of a class that implements either IModelExportContext or IPhotoRenderContext interfaces.

#### Reference

CustomExporter Class

Autodesk.Revit.DB Namespace